Revit 2027 API
BuiltInFailures.RoomFailures.RoomNotEnclosedRooms Property
 [Room] is not in a properly enclosed region
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RoomNotEnclosedRooms { get; }
Public Shared ReadOnly Property RoomNotEnclosedRooms As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RoomNotEnclosedRooms {
	FailureDefinitionId^ get ();
}
static member RoomNotEnclosedRooms : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RoomFailures Class
Autodesk.Revit.DB Namespace